---
kind: property
id: P:Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs.LinkedResourcePathName
source: html/c963dc67-3469-a226-271c-5be18a1ac7ab.htm
---
# Autodesk.Revit.DB.Events.LinkedResourceOpenedEventArgs.LinkedResourcePathName Property

Path of the linked resource.

## Syntax (C#)
```csharp
public string LinkedResourcePathName { get; }
```